Revit 2027 API
PlanCircuitSet.ReverseIterator Method
Retrieve a backward moving iterator to the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual PlanCircuitSetIterator ReverseIterator()
Public Overridable Function ReverseIterator As PlanCircuitSetIterator
public:
virtual PlanCircuitSetIterator^ ReverseIterator()
abstract ReverseIterator : unit -> PlanCircuitSetIterator
override ReverseIterator : unit -> PlanCircuitSetIterator
Return Value
PlanCircuitSetIterator
Returns a backward moving iterator to the set.
See Also
Reference
PlanCircuitSet Class
Autodesk.Revit.DB Namespace